from django.core.management.base import BaseCommand
from landing.models import Qualification


class Command(BaseCommand):
    help = "Заполняет таблицу Qualification всеми профессиональными квалификациями."

    def handle(self, *args, **options):
        qualifications = [
            ("40.20900.07", "Специалист по техническому диагностированию и освидетельствованию технических устройств на опасных производственных объектах химической промышленности, а также других взрывопожароопасных и вредных производств (6-й уровень квалификации)"),
            ("40.20900.104", "Эксперт I категории в области промышленной безопасности технических устройств на опасных производственных объектах I, II, III и IV класса опасности газоснабжения (7-й уровень квалификации)"),
            ("40.20900.105", "Эксперт II категории в области промышленной безопасности технических устройств на опасных производственных объектах II, III и IV класса опасности газоснабжения (7-й уровень квалификации)"),
            ("40.20900.106", "Эксперт III категории в области промышленной безопасности технических устройств на опасных производственных объектах III и IV класса опасности, использующих оборудование, работающее под давлением более 0,07 МПа или при температуре нагрева воды более 115 °C (7-й уровень квалификации)"),
            ("40.20900.107", "Эксперт I категории в области промышленной безопасности технических устройств, применяемых на опасных производственных объектах I, II, III и IV класса опасности, использующих оборудование, работающее под давлением более 0,07 МПа или при температуре нагрева воды более 115 °C (7-й уровень квалификации)"),
            ("40.20900.108", "Эксперт II категории в области промышленной безопасности технических устройств, применяемых на опасных производственных объектах II, III и IV класса опасности, использующих оборудование, работающее под давлением более 0,07 МПа или при температуре нагрева воды более 115 °C (7-й уровень квалификации)"),
            ("40.20900.109", "Эксперт III категории в области промышленной безопасности технических устройств, применяемых на опасных производственных объектах III и IV класса опасности, использующих оборудование, работающее под давлением более 0,07 МПа или при температуре нагрева воды более 115 °C (7-й уровень квалификации)"),
            ("40.20900.110", "Эксперт III категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах I, II, III и IV класса опасности горнорудной и нерудной промышленности (7-й уровень квалификации)"),
            ("40.20900.122", "Эксперт I категории в области промышленной безопасности технических устройств на опасных производственных объектах I, II, III и IV класса опасности, на которых используются стационарно установленные грузоподъемные механизмы (7-й уровень квалификации)"),
            ("40.20900.123", "Эксперт II категории в области промышленной безопасности технических устройств на опасных производственных объектах II, III и IV класса опасности, на которых используются стационарно установленные грузоподъемные механизмы (7-й уровень квалификации)"),
            ("40.20900.124", "Эксперт III категории в области промышленной безопасности технических устройств на опасных производственных объектах III и IV класса опасности, на которых используются стационарно установленные грузоподъемные механизмы (7-й уровень квалификации)"),
            ("40.20900.131", "Эксперт I категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах I, II, III и IV класса опасности горнорудной и нерудной промышленности (7-й уровень квалификации)"),
            ("40.20900.132", "Эксперт II категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах II, III и IV класса опасности горнорудной и нерудной промышленности (7-й уровень квалификации)"),
            ("40.20900.133", "Эксперт III категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах III и IV класса опасности горнорудной и нерудной промышленности (7-й уровень квалификации)"),
            ("40.20900.140", "Эксперт I категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах I, II, III и IV класса опасности нефтегазодобывающего комплекса (7-й уровень квалификации)"),
            ("40.20900.141", "Эксперт II категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах II, III и IV класса опасности нефтегазодобывающего комплекса (7-й уровень квалификации)"),
            ("40.20900.142", "Эксперт III категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах III и IV класса опасности нефтегазодобывающего комплекса (7-й уровень квалификации)"),
            ("40.20900.149", "Эксперт I категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах I, II, III и IV класса опасности химической, нефтехимической и нефтеперерабатывающей промышленности, а также других взрывопожароопасных и вредных производств (7-й уровень квалификации)"),
            ("40.20900.150", "Эксперт II категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах II, III и IV класса опасности химической, нефтехимической и нефтеперерабатывающей промышленности, а также других взрывопожароопасных и вредных производств (7-й уровень квалификации)"),
            ("40.20900.151", "Эксперт III категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах III и IV класса опасности химической, нефтехимической и нефтеперерабатывающей промышленности, а также других взрывопожароопасных и вредных производств (7-й уровень квалификации)"),
            ("40.20900.161", "Эксперт I категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах I, II, III и IV класса опасности газоснабжения (7-й уровень квалификации)"),
            ("40.20900.162", "Эксперт II категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах II, III и IV класса опасности газоснабжения (7-й уровень квалификации)"),
            ("40.20900.163", "Эксперт III категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах III и IV класса опасности газоснабжения (7-й уровень квалификации)"),
            ("40.20900.164", "Эксперт I категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах I, II, III и IV класса опасности газоснабжения (7-й уровень квалификации)"),
            ("40.20900.165", "Эксперт II категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах II, III и IV класса опасности, использующих оборудование, работающее под давлением более 0,07 МПа или при температуре нагрева воды более 115 °C (7-й уровень квалификации)"),
            ("40.20900.166", "Эксперт III категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах III и IV класса опасности, использующих оборудование, работающее под давлением более 0,07 МПа или при температуре нагрева воды более 115 °C (7-й уровень квалификации)"),
            ("40.20900.167", "Эксперт I категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах I, II, III и IV класса опасности металлургической промышленности и опасных производственных объектов II, III и IV класса опасности производства черных и цветных металлов (7-й уровень квалификации)"),
            ("40.20900.168", "Эксперт II категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах II, III и IV класса опасности металлургической промышленности и опасных производственных объектов II, III и IV класса опасности производства черных и цветных металлов (7-й уровень квалификации)"),
            ("40.20900.169", "Эксперт III категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах III и IV класса опасности металлургической промышленности и опасных производственных объектов III и IV класса опасности производства черных и цветных металлов (7-й уровень квалификации)"),
            ("40.20900.179", "Эксперт I категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах I, II, III и IV класса опасности, на которых используются стационарно установленные грузоподъемные механизмы (7-й уровень квалификации)"),
            ("40.20900.180", "Эксперт II категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах II, III и IV класса опасности, на которых используются стационарно установленные грузоподъемные механизмы (7-й уровень квалификации)"),
            ("40.20900.181", "Эксперт III категории в области промышленной безопасности зданий и сооружений на опасных производственных объектах III и IV класса опасности, на которых используются стационарно установленные грузоподъемные механизмы (7-й уровень квалификации)"),
            ("40.20900.21", "Специалист по обследованию и освидетельствованию зданий и сооружений на опасных производственных объектах химической промышленности, а также других взрывопожароопасных и вредных производств (6-й уровень квалификации)"),
            ("40.20900.25", "Специалист по обследованию и освидетельствованию зданий и сооружений на опасных производственных объектах металлургической промышленности, а также производства черных и цветных металлов (6-й уровень квалификации)"),
            ("40.20900.28", "Специалист по обследованию и освидетельствованию зданий и сооружений на опасных производственных объектах, включая объекты транспорта и метрополитена (6-й уровень квалификации)"),
            ("40.20900.74", "Эксперт I категории в области промышленной безопасности технических устройств на опасных производственных объектах I, II, III и IV класса опасности горнорудной и нерудной промышленности (7-й уровень квалификации)"),
            ("40.20900.75", "Эксперт II категории в области промышленной безопасности технических устройств на опасных производственных объектах II, III и IV класса опасности горнорудной и нерудной промышленности (7-й уровень квалификации)"),
            ("40.20900.76", "Эксперт III категории в области промышленной безопасности технических устройств на опасных производственных объектах III и IV класса опасности горнорудной и нерудной промышленности (7-й уровень квалификации)"),
            ("40.20900.83", "Эксперт I категории в области промышленной безопасности технических устройств на опасных производственных объектах I, II, III и IV класса опасности нефтегазодобывающего комплекса (7-й уровень квалификации)"),
            ("40.20900.84", "Эксперт II категории в области промышленной безопасности технических устройств на опасных производственных объектах II, III и IV класса опасности нефтегазодобывающего комплекса (7-й уровень квалификации)"),
            ("40.20900.85", "Эксперт III категории в области промышленной безопасности технических устройств на опасных производственных объектах III и IV класса опасности нефтегазодобывающего комплекса (7-й уровень квалификации)"),
        ]

        Qualification.objects.all().delete()
        created = 0
        for code, title in qualifications:
            Qualification.objects.create(code=code, title=title)
            created += 1

        self.stdout.write(self.style.SUCCESS(f"Добавлено {created} квалификаций."))
